## Import Required Libraries

In [8]:
import numpy as np
import pandas as pd

## Create a DataFrame from a Python Dictionary

In [9]:
dict_1 = {
    'name': ['ahad', 'aryan', 'asif', 'aliyan'],
    'marks': [83, 67, 34, 55],
    'city': ['karachi', 'sialkot', 'gujrat', 'Islamabad']
}

df = pd.DataFrame(dict_1)
df

     name  marks       city
0    ahad     83    karachi
1   aryan     67    sialkot
2    asif     34     gujrat
3  aliyan     55  Islamabad

## Save DataFrame to CSV Files

In [3]:
df.to_csv('friends.csv')
df.to_csv('friends_without_index.csv', index=False)

## Display First and Last Rows

In [10]:
df.head(2)

    name  marks     city
0   ahad     83  karachi
1  aryan     67  sialkot

In [11]:
df.tail(2)

     name  marks       city
2    asif     34     gujrat
3  aliyan     55  Islamabad

## Get Summary Statistics

In [12]:
df.describe()

           marks
count   4.000000
mean   59.750000
std    20.645823
min    34.000000
25%    49.750000
50%    61.000000
75%    71.000000
max    83.000000

## Read Data from an Existing CSV File

In [13]:
_csv = pd.read_csv('mani.csv')
_csv

    _name  train_no       city
0    ahad        83    karachi
1   aryan        67    sialkot
2    asif        34     gujrat
3  aliyan        55  Islamabad

## Modify Data in DataFrame

In [14]:
_csv['city'][0] = 'new_york'
_csv.to_csv('mani2.csv', index=False)

# Update index labels
_csv.index = ['one', 'two', 'three', 'four']
_csv

C:\Users\DELL\AppData\Local\Temp\ipykernel_928\525634901.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  _csv['city'][0] = 'new_york'
C:\Users\DELL\AppData\Local\Temp\ipykernel_928\525634901.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  _csv['city'][0] = 'new_york'

        _name  train_no       city
one      ahad        83   new_york
two     aryan        67    sialkot
three    asif        34     gujrat
four   aliyan        55  Islamabad